---
layout: post
title: Семиотическая модель на базе когнитивных экспериментов применительно к вопросно-ответной задаче.
---

### Александр Сиренко

Московский Государственный Технический Университет им. Баумана, Россия, Москва, 2-я Бауманская улица, стр. 5
iTim Technologies Ltd.

alexander.sirenko@gmail.com


### Галина Черкасова

Институт Лингвистики, Российская Академия Наук, Россия, Москва, Большой Кисловский переулок, стр.1

gacherk@mail.ru

### Юрий Филиппович

Государственный Технический Университет им. Н.Э.Баумана, Россия, Москва, 2-я Бауманская улица, стр. 5

y_philippovich@mail.ru

### Юрий Караулов

Институт Русского языка им. В.В.Виноградова Российской Академии Наук, Россия, Москва, ул. Волхонка, 18/2

karaoulov@rambler.ru

## Аннотация
Расширение запроса улучшает качество этапа извлечения документов в цепочке работы вопросно-ответной системы. Мы утверждаем преимущества персонализированной и автономной обработки запроса и автоматизируем семиотическую модель для достижения данных характеристик. Модель функционирует как контекстно-зависимая взвешенная грамматика, используя алгоритм применения правил с неполным совпадением. Семиотическая модель стала основой регрессионной модели предсказания релевантных запросу термов. ROC-анализ оценивает регрессионную модель и помогает выбрать оптимальный порог отсечения. Мы сравниваем ранжирование термов регрессионной моделью и ранжирование внешней информационно-поисковой системы (ИПС).

### Ключевые слова.
семиотическое моделирование, когнитивные эксперименты, грамматика, расширение запроса, регрессия, вопросно-ответная система

## 1. Введение
Вопросно-ответная задача (Question Answering - QA) глубоко проработана, в том числе через специальные направления конференции Text REtrieval Conference (TREC). Опубликованные недавно решения следуют стандартной последовательности шагов (QA pipeline) \cite{Bilotti04}:
1. обработать запрос;
2. извлечь релевантные запросу документы/фрагменты;
3. извлечь информацию и сформировать возможные ответы;
4. ранжировать ответы для выбора наилучшего.

QA pipeline находит ответы в коллекции неструктурированных текстов, поэтому качество извлечения документов может ограничить производительность всей системы. Существуют различные способы увеличить полноту извлечения. В данном исследовании мы фокусируемся на расширении запроса релевантными термами в рамках подхода (QA pipeline).

Поскольку Интернет является наиболее популярным способом предоставления информационных сервисов, мы учитываем два тренда: персонализацию сервисов и широкое использование мощных персональных устройств для доступа в сеть. Сегодня пользователи предоставляют личную информацию (историю запросов, местоположение, тексты сообщений) в поисковой системой для получения релевантных результатов. Если запрос предобрабатывается локально без общения с внешней системой, вероятнее предоставление пользователем личной информации. Подобный локальный препроцессор должен быть построен без дорогостоящей структурированной информации.

Мы предполагаем построение когнитивной семиотической модели на основе ассоциативной сети и набора когнитивных элементов \cite{PhilippovichNeuromodel2013}. Психолингвисты научной школы "Русская языковая личность" описали когнитивную модель и опросили людей для сбора эмпирических данных. Это позволяет построить модель для "усредненного" носителя русского языка.
